Yu-Ting-Sun/yiki-m55m1/Slideshow.c
/**************************************************************************//**
 * @file     Slideshow.c
 * @brief    SD-card photo slideshow on the LCD — JPG (on-device decode) + BMP.
 *
 * JPEG: decoded on-device with TJpgDec (baseline JPEG, no malloc, static
 * pool). Phone photos (e.g. 4032x3024) use TJpgDec's built-in 1/2 1/4 1/8
 * descaling: the largest scale whose output fits the panel is chosen, decoded
 * into a HyperRAM frame buffer (rear spare @SLIDESHOW_FB_ADDR), then blitted
 * to the LCD in bands through an SRAM2 bounce buffer. Progressive JPEGs are
 * not decodable on this RAM class and are skipped with a message.
 *
 * BMP: uncompressed 24-bpp, streamed straight from SD in bands (no FB needed).
 *
 * PNG/HEIC: skipped with a hint to use scripts/prepare_pictures.py.
 *
 * Buffers: band buffers + TJpgDec pool live in `.bss.vram.data` (SRAM2,
 * 320 KB, CPU/PDMA-only — never used by the models or the NPU).
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 ******************************************************************************/
#include "Slideshow.h"

#include <stdio.h>
#include <string.h>
#include <stdbool.h>

#include "NuMicro.h"
#include "ff.h"
#include "Display.h"
#include "MemoryLayout.h"   /* SLIDESHOW_FB_ADDR / _SIZE */
#include "StoryUI.h"        /* story rail follows the album on screen */
#include "tjpgd.h"

/* Show the file name in the bottom-left corner of each photo. */
#define SLIDE_CAPTION       (1)

#define SLIDE_MAX_W         (800)   /* LT7381 horizontal resolution */
#define SLIDE_BAND_ROWS     (20)
#define SLIDE_MAX_ROWBYTES  (((SLIDE_MAX_W * 3u) + 3u) & ~3u)

/* TJpgDec working pool. Requirement (R0.03, JD_FASTDECODE=2): ~3.5 KB base
 * + 6 KB huffman LUT + JD_SZBUF (4 KB) stream buffer + MCU work area. 32 KB
 * leaves ample headroom. */
#define SLIDE_JD_POOL_SZ    (32 * 1024)

/* Band/bounce buffers -> SRAM2 (.bss.vram.data). */
__attribute__((section(".bss.vram.data"), aligned(32)))
static uint8_t  s_bandRaw[SLIDE_BAND_ROWS * SLIDE_MAX_ROWBYTES];   /* BMP rows */
__attribute__((section(".bss.vram.data"), aligned(32)))
static uint16_t s_bandPix[SLIDE_BAND_ROWS * SLIDE_MAX_W];          /* RGB565 band */
__attribute__((section(".bss.vram.data"), aligned(8)))
static uint8_t  s_jdPool[SLIDE_JD_POOL_SZ];                        /* TJpgDec pool */

static FIL s_photoFile;   /* FIL is large; keep off the stack */

/* Columns at the right of the panel the slideshow must not paint (story panel). */
static uint32_t s_rightReserve = 0;

void Slideshow_ReserveRight(uint32_t px) { s_rightReserve = px; }

static uint16_t le16(const uint8_t *p) { return (uint16_t)(p[0] | (p[1] << 8)); }
static uint32_t le32(const uint8_t *p)
{
    return (uint32_t)p[0] | ((uint32_t)p[1] << 8) |
           ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

/*----------------------------------------------------------------------------
 * File-name classification
 *--------------------------------------------------------------------------*/
static bool ext_is(const char *name, const char *ext)   /* ext lowercase, with dot */
{
    size_t n = strlen(name), e = strlen(ext);
    if (n < e + 1) return false;
    const char *p = name + n - e;
    for (size_t i = 0; i < e; i++)
    {
        char c = p[i];
        if (c >= 'A' && c <= 'Z') c = (char)(c + 32);
        if (c != ext[i]) return false;
    }
    return true;
}

static bool name_is_bmp(const char *n)  { return ext_is(n, ".bmp"); }
static bool name_is_jpg(const char *n)  { return ext_is(n, ".jpg") || ext_is(n, ".jpeg"); }
static bool name_is_png(const char *n)  { return ext_is(n, ".png"); }
static bool name_is_heic(const char *n) { return ext_is(n, ".heic") || ext_is(n, ".heif"); }

/*----------------------------------------------------------------------------
 * Common: blit one RGB565 band buffer to the LCD
 *--------------------------------------------------------------------------*/
static void blit_band(const uint16_t *pix, uint32_t x, uint32_t y,
                      uint32_t w, uint32_t h)
{
    S_DISP_RECT rect;
    rect.u32TopLeftX     = x;
    rect.u32TopLeftY     = y;
    rect.u32BottonRightX = x + w - 1u;
    rect.u32BottonRightY = y + h - 1u;
    Display_FillRect((uint16_t *)pix, &rect, 1);
}

/*----------------------------------------------------------------------------
 * JPEG path (TJpgDec)
 *--------------------------------------------------------------------------*/
typedef struct
{
    FIL      *fp;      /* open file being decoded                  */
    uint16_t *fb;      /* decode target (HyperRAM frame buffer)    */
    uint32_t  fbW;     /* scaled image width = fb row stride       */
} JpegSession;

/* TJpgDec input callback: read (or skip, when buf==NULL) len bytes. */
static size_t jpeg_in_cb(JDEC *jd, uint8_t *buf, size_t len)
{
    JpegSession *s = (JpegSession *)jd->device;

    if (buf)
    {
        UINT br = 0;
        if (f_read(s->fp, buf, (UINT)len, &br) != FR_OK)
            return 0;
        return (size_t)br;
    }
    return (f_lseek(s->fp, f_tell(s->fp) + len) == FR_OK) ? len : 0;
}

/* TJpgDec output callback: copy an RGB565 block into the frame buffer. */
static int jpeg_out_cb(JDEC *jd, void *bitmap, JRECT *rect)
{
    JpegSession    *s   = (JpegSession *)jd->device;
    const uint16_t *src = (const uint16_t *)bitmap;
    uint32_t        w   = (uint32_t)(rect->right - rect->left + 1);
    uint32_t        h   = (uint32_t)(rect->bottom - rect->top + 1);

    for (uint32_t y = 0; y < h; y++)
        memcpy(s->fb + (uint32_t)(rect->top + y) * s->fbW + rect->left,
               src + y * w, w * 2u);
    return 1;   /* continue decoding */
}

/**
 * Decode + display one JPEG. 0 on success; negative on skip/error:
 *  -1 open failed, -10 jd_prepare failed (bad/unsupported JPEG, e.g.
 *  progressive), -11 too large even at 1/8 scale, -12 decode error.
 */
static int show_jpg(const char *path, uint32_t panelW, uint32_t panelH)
{
    JDEC        jd;
    JpegSession sess;
    JRESULT     jr;

