Yu-Ting-Sun/yiki-m55m1/Slideshow.c
    if (f_open(&s_photoFile, path, FA_OPEN_EXISTING | FA_READ) != FR_OK)
        return -1;

    sess.fp  = &s_photoFile;
    sess.fb  = (uint16_t *)SLIDESHOW_FB_ADDR;
    sess.fbW = 0;

    jr = jd_prepare(&jd, jpeg_in_cb, s_jdPool, sizeof(s_jdPool), &sess);
    if (jr != JDR_OK)
    {
        f_close(&s_photoFile);
        printf("[SLIDESHOW] jd_prepare rc=%d (progressive JPEG or corrupt file?)\n", (int)jr);
        return -10;
    }

    /* Pick the largest output (smallest scale n) that fits the region; if
     * even 1/8 is too big (12-MP photo into the 360-px photo region), keep
     * the 1/8 decode and nearest-resample down during the blit. */
    uint8_t  scale;
    uint32_t sw = 0, sh = 0;

    for (scale = 0; scale <= 3; scale++)
    {
        sw = (uint32_t)jd.width  >> scale;
        sh = (uint32_t)jd.height >> scale;
        if (sw <= panelW && sh <= panelH) break;
    }
    if (sw == 0 || sh == 0 || sw * sh * 2u > SLIDESHOW_FB_SIZE)
    {
        f_close(&s_photoFile);
        printf("[SLIDESHOW] %ux%u undecodable (exceeds FB even at 1/8 scale)\n",
               (unsigned)jd.width, (unsigned)jd.height);
        return -11;
    }

    sess.fbW = sw;   /* decode target stride = scaled width */

    jr = jd_decomp(&jd, jpeg_out_cb, scale);
    f_close(&s_photoFile);

    if (jr != JDR_OK)
    {
        printf("[SLIDESHOW] jd_decomp rc=%d\n", (int)jr);
        return -12;
    }

    /* Contain-fit in both directions: TJpgDec's power-of-2 scales rarely
     * land on the region size, so nearest-resample while blitting — down
     * when even 1/8 is too big, up (capped at 2x so tiny files don't turn
     * to mush) to fill the region, e.g. 12-MP landscape 504x378 -> 640x480. */
    uint32_t ow = panelW;
    uint32_t oh = sh * panelW / sw;
    if (oh > panelH)
    {
        oh = panelH;
        ow = sw * panelH / sh;
    }
    if (ow == 0 || oh == 0 || ow > 2u * sw || oh > 2u * sh)
    {
        ow = sw;   /* tiny image: just center it unscaled */
        oh = sh;
    }

    /* Banded blit: HyperRAM FB -> SRAM2 bounce -> LCD, centered. */
    uint32_t offX = (panelW - ow) / 2u;
    uint32_t offY = (panelH - oh) / 2u;

    if (ow < panelW || oh < panelH)
    {
        /* Not full-bleed: clear the photo region so a previous larger
         * photo can't linger around this one. */
        S_DISP_RECT r = { 0, 0, panelW - 1u, panelH - 1u };
        Display_ClearRect(C_BLACK, &r);
    }

    for (uint32_t y = 0; y < oh; y += SLIDE_BAND_ROWS)
    {
        uint32_t n = oh - y;
        if (n > SLIDE_BAND_ROWS) n = SLIDE_BAND_ROWS;

        if (ow == sw && oh == sh)
            memcpy(s_bandPix, sess.fb + y * sw, n * sw * 2u);
        else
        {
            for (uint32_t r = 0; r < n; r++)
            {
                const uint16_t *srow = sess.fb + ((y + r) * sh / oh) * sw;
                uint16_t       *dst  = s_bandPix + r * ow;

                for (uint32_t x = 0; x < ow; x++)
                    dst[x] = srow[x * sw / ow];
            }
        }
        blit_band(s_bandPix, offX, offY + y, ow, n);
    }
    return 0;
}

/*----------------------------------------------------------------------------
 * BMP path (24-bpp uncompressed, streamed in bands; no frame buffer)
 *--------------------------------------------------------------------------*/
static int show_bmp(const char *path, uint32_t panelW, uint32_t panelH)
{
    UINT    br;
    uint8_t hdr[54];

    if (f_open(&s_photoFile, path, FA_OPEN_EXISTING | FA_READ) != FR_OK)
        return -1;

    if (f_read(&s_photoFile, hdr, sizeof(hdr), &br) != FR_OK || br != sizeof(hdr) ||
        hdr[0] != 'B' || hdr[1] != 'M')
    {
        f_close(&s_photoFile);
        return -2;
    }

    uint32_t offBits = le32(hdr + 10);
    int32_t  w       = (int32_t)le32(hdr + 18);
    int32_t  h       = (int32_t)le32(hdr + 22);
    uint16_t bpp     = le16(hdr + 28);
    uint32_t comp    = le32(hdr + 30);

    int topdown = 0;
    if (h < 0) { topdown = 1; h = -h; }

    if (bpp != 24 || comp != 0 || w <= 0 || h <= 0)
    {
        f_close(&s_photoFile);
        return -3;
    }
    if ((uint32_t)w > panelW || (uint32_t)h > panelH || w > SLIDE_MAX_W)
    {
        f_close(&s_photoFile);
        return -4;
    }

    uint32_t rowBytes = (((uint32_t)w * 3u) + 3u) & ~3u;
    uint32_t offX = (panelW - (uint32_t)w) / 2u;
    uint32_t offY = (panelH - (uint32_t)h) / 2u;

    if ((uint32_t)w < panelW || (uint32_t)h < panelH)
    {
        /* Not full-bleed: clear the photo region so a previous larger
         * photo can't linger around this one. */
        S_DISP_RECT r = { 0, 0, panelW - 1u, panelH - 1u };
        Display_ClearRect(C_BLACK, &r);
    }

    f_lseek(&s_photoFile, offBits);

    uint32_t fileRow = 0;
    while (fileRow < (uint32_t)h)
    {
        uint32_t n = (uint32_t)h - fileRow;
        if (n > SLIDE_BAND_ROWS) n = SLIDE_BAND_ROWS;

        if (f_read(&s_photoFile, s_bandRaw, rowBytes * n, &br) != FR_OK ||
            br != rowBytes * n)
        {
            f_close(&s_photoFile);
            return -5;
        }

        /* top-down BMP: rows [fileRow..]; bottom-up: reversed block */
        uint32_t bandTop = topdown ? fileRow : ((uint32_t)h - fileRow - n);

        for (uint32_t r = 0; r < n; r++)
        {
            const uint8_t *src  = s_bandRaw + r * rowBytes;
            uint32_t imgY       = topdown ? (fileRow + r)
                                          : ((uint32_t)h - 1u - (fileRow + r));
            uint16_t *dst       = s_bandPix + (imgY - bandTop) * (uint32_t)w;

            for (int32_t x = 0; x < w; x++)
            {
                uint8_t b  = src[3 * x + 0];
                uint8_t g  = src[3 * x + 1];
                uint8_t rr = src[3 * x + 2];
                dst[x] = (uint16_t)(((rr & 0xF8u) << 8) | ((g & 0xFCu) << 3) | (b >> 3));
            }
        }

        blit_band(s_bandPix, offX, offY + bandTop, (uint32_t)w, n);
        fileRow += n;
    }

    f_close(&s_photoFile);
    return 0;
}

/*----------------------------------------------------------------------------
 * Photo library — albums are the subfolders of the root, each optionally
 * carrying a label.json ({"users": ["user1", ...]}, hand-written or later
 * emitted by the backend). Loose files in the root form an unlabeled
 * pseudo-album (index 0) that only plays when no filter is active, so a flat
 * pictures/ SD card from the pre-album era keeps working unchanged.
 *--------------------------------------------------------------------------*/
#define LIB_MAX_ALBUMS      (16)
#define LIB_MAX_USERS       (8)     /* per album */
#define LIB_NAME_LEN        (64)    /* album folder name */
#define LIB_USER_LEN        (24)
#define LIB_LABEL_FILE      "label.json"
#define LIB_LABEL_MAX       (512)   /* bytes of label.json parsed */

typedef struct
{
    char    name[LIB_NAME_LEN];     /* "" = loose files in the root */
    char    users[LIB_MAX_USERS][LIB_USER_LEN];
    uint8_t nUsers;
} Album;

static char    s_root[64];
static Album   s_albums[LIB_MAX_ALBUMS];
static uint8_t s_nAlbums;                    /* incl. pseudo-album 0 */

static char    s_filter[LIB_USER_LEN];       /* "" = play everything */
static uint8_t s_matched[LIB_MAX_ALBUMS];    /* album indices in play set */
static uint8_t s_nMatched;
static bool    s_restart;                    /* filter changed: reset cursor */

/* Iteration state across Slideshow_ShowNext() calls. */
static DIR     s_iterDir;
static bool    s_iterOpen;
static uint8_t s_cursor;                     /* index into s_matched */
static uint8_t s_albumsDone;                 /* albums exhausted this cycle */
static uint32_t s_shownInCycle;
static uint32_t s_photosThisAlbum;           /* photos shown since album open */

