Yu-Ting-Sun/yiki-m55m1/Slideshow.c
/* Story rail state: which album's STORY.TIM is on the rail right now.
 * STORY.TIM sits next to the photos (backend sync / scripts/export_sd.py). */
#define ALBUM_STORY_FILE    "STORY.TIM"
static uint8_t s_storyAlbum = 0xFF;          /* album index shown in the rail */
static bool    s_storyHasStory = false;      /* rail shows a story (vs empty) */

static bool str_ieq(const char *a, const char *b)
{
    for (; *a && *b; a++, b++)
    {
        char ca = (*a >= 'A' && *a <= 'Z') ? (char)(*a + 32) : *a;
        char cb = (*b >= 'A' && *b <= 'Z') ? (char)(*b + 32) : *b;
        if (ca != cb) return false;
    }
    return *a == *b;
}

/* Naive fixed-structure parser: pull the quoted strings out of the "users"
 * array. No JSON library on this board; anything malformed just yields
 * fewer users, never a crash. */
static void lib_read_label(const char *dirPath, Album *al)
{
    char path[300], buf[LIB_LABEL_MAX + 1];
    UINT br = 0;

    al->nUsers = 0;

    snprintf(path, sizeof(path), "%s\\%s", dirPath, LIB_LABEL_FILE);
    if (f_open(&s_photoFile, path, FA_OPEN_EXISTING | FA_READ) != FR_OK)
        return;                     /* unlabeled album: plays only unfiltered */
    f_read(&s_photoFile, buf, LIB_LABEL_MAX, &br);
    f_close(&s_photoFile);
    buf[br] = 0;

    const char *p = strstr(buf, "\"users\"");
    if (!p || (p = strchr(p, '[')) == NULL) return;
    const char *end = strchr(p, ']');

    while (al->nUsers < LIB_MAX_USERS)
    {
        const char *q0 = strchr(p, '"');
        if (!q0 || (end && q0 > end)) break;
        const char *q1 = strchr(q0 + 1, '"');
        if (!q1) break;

        size_t n = (size_t)(q1 - q0) - 1u;
        if (n >= LIB_USER_LEN) n = LIB_USER_LEN - 1;
        memcpy(al->users[al->nUsers], q0 + 1, n);
        al->users[al->nUsers][n] = 0;
        al->nUsers++;
        p = q1 + 1;
    }
}

/* Rebuild s_matched from s_filter and flag the iterator for a restart. */
static void lib_apply_filter(void)
{
    s_nMatched = 0;

    for (uint8_t i = 0; i < s_nAlbums; i++)
    {
        if (s_filter[0] == 0)
        {
            s_matched[s_nMatched++] = i;    /* no filter: everything */
            continue;
        }
        for (uint8_t u = 0; u < s_albums[i].nUsers; u++)
        {
            if (str_ieq(s_albums[i].users[u], s_filter))
            {
                s_matched[s_nMatched++] = i;
                break;
            }
        }
    }

    if (s_filter[0] != 0 && s_nMatched == 0)
    {
        /* Unknown user: degrade to playing everything (same philosophy as
         * the Wi-Fi fallback — never a black screen). */
        printf("[SLIDESHOW] filter '%s' matches no album -> playing all\n", s_filter);
        for (uint8_t i = 0; i < s_nAlbums; i++)
            s_matched[s_nMatched++] = i;
    }

    s_restart = true;
}

/* Story rail follows the album on screen. Returns 0 iff the rail now shows
 * this album's story; albums without STORY.TIM (incl. the loose-file
 * pseudo-album) get the empty panel back. */
static int story_follow_album(uint8_t albumIdx)
{
    const Album *al;
    char path[300];
    int  rc = -4;

    if (albumIdx == s_storyAlbum)               /* rail already up to date */
        return s_storyHasStory ? 0 : -1;

    al = &s_albums[albumIdx];
    if (al->name[0])
    {
        snprintf(path, sizeof(path), "%s\\%s\\" ALBUM_STORY_FILE,
                 s_root, al->name);
        rc = StoryUI_ShowTextImageFile(path);
    }

    if (rc == 0)
        printf("[SLIDESHOW] story rail -> album '%s'\n", al->name);
    else
        StoryUI_DrawChrome();                   /* no story: empty panel */

    s_storyAlbum    = albumIdx;
    s_storyHasStory = (rc == 0);
    return s_storyHasStory ? 0 : -1;
}

int Slideshow_LibScan(const char *rootPath)
{
    DIR     dir;
    FILINFO fno;
    TCHAR   drv[] = { '0', ':', 0 };

    f_chdrive(drv);

    /* Album indices are about to change; forget what the rail shows. */
    s_storyAlbum    = 0xFF;
    s_storyHasStory = false;

    strncpy(s_root, rootPath, sizeof(s_root) - 1);
    s_root[sizeof(s_root) - 1] = 0;

    /* Pseudo-album 0: loose files directly in the root, no label. */
    s_albums[0].name[0] = 0;
    s_albums[0].nUsers  = 0;
    s_nAlbums = 1;

    if (f_opendir(&dir, rootPath) != FR_OK)
    {
        printf("[SLIDESHOW] cannot open %s (folder missing on SD?)\n", rootPath);
        s_nAlbums = 0;
        return -1;
    }

    while (f_readdir(&dir, &fno) == FR_OK && fno.fname[0] != 0)
    {
        if (!(fno.fattrib & AM_DIR)) continue;

        if (s_nAlbums >= LIB_MAX_ALBUMS)
        {
            printf("[SLIDESHOW] more than %d albums; extras ignored\n",
                   LIB_MAX_ALBUMS - 1);
            break;
        }

        Album *al = &s_albums[s_nAlbums++];
        strncpy(al->name, fno.fname, LIB_NAME_LEN - 1);
        al->name[LIB_NAME_LEN - 1] = 0;

        char sub[300];
        snprintf(sub, sizeof(sub), "%s\\%s", rootPath, al->name);
        lib_read_label(sub, al);

        printf("[SLIDESHOW] album '%s': %u labeled user(s)", al->name,
               (unsigned)al->nUsers);
        for (uint8_t u = 0; u < al->nUsers; u++)
            printf("%s%s", u ? ", " : " [", al->users[u]);
        printf(al->nUsers ? "]\n" : "\n");
    }
    f_closedir(&dir);

    lib_apply_filter();             /* re-apply whatever filter is stored */
    return (int)(s_nAlbums - 1);    /* number of real albums found */
}

int Slideshow_SetFilter(const char *user)
{
    if (user == NULL) user = "";
    strncpy(s_filter, user, sizeof(s_filter) - 1);
    s_filter[sizeof(s_filter) - 1] = 0;

    if (s_nAlbums == 0) return 0;   /* not scanned yet; LibScan will apply */

    lib_apply_filter();
    printf("[SLIDESHOW] filter '%s' -> %u album(s) in play set\n",
           s_filter[0] ? s_filter : "(none)", (unsigned)s_nMatched);
    return (int)s_nMatched;
}

int Slideshow_ShowNext(void)
{
    FILINFO fno;

    uint32_t panelW = Disaplay_GetLCDWidth();
    uint32_t panelH = Disaplay_GetLCDHeight();

    /* Photos letterbox into the region left of the reserved panel (StoryUI). */
    if (s_rightReserve < panelW)
        panelW -= s_rightReserve;

    if (s_nAlbums == 0 || s_nMatched == 0)
        return -1;                  /* Slideshow_LibScan not run / failed */

    if (s_restart)
    {
        if (s_iterOpen) { f_closedir(&s_iterDir); s_iterOpen = false; }
        s_cursor = 0;
        s_albumsDone = 0;
        s_shownInCycle = 0;
        s_restart = false;

