Yu-Ting-Sun/yiki-m55m1/Slideshow.c
        /* Clear the photo region so leftovers from the previous play set
         * (larger photo, stale caption) can't linger. */
        S_DISP_RECT r = { 0, 0, panelW - 1u, panelH - 1u };
        Display_ClearRect(C_BLACK, &r);
    }

    for (;;)
    {
        if (!s_iterOpen)
        {
            if (s_albumsDone >= s_nMatched)     /* full cycle completed */
            {
                if (s_shownInCycle == 0)
                {
                    printf("[SLIDESHOW] no displayable photo (.jpg/.bmp) in play set\n");
                    return -2;
                }
                s_albumsDone = 0;
                s_shownInCycle = 0;             /* wrap: loop forever */
            }

            const Album *al = &s_albums[s_matched[s_cursor]];
            char dirPath[300];

            if (al->name[0])
                snprintf(dirPath, sizeof(dirPath), "%s\\%s", s_root, al->name);
            else
                snprintf(dirPath, sizeof(dirPath), "%s", s_root);

            if (f_opendir(&s_iterDir, dirPath) != FR_OK)
            {
                s_albumsDone++;
                s_cursor = (uint8_t)((s_cursor + 1) % s_nMatched);
                continue;
            }
            s_iterOpen = true;
            s_photosThisAlbum = 0;
        }

        if (f_readdir(&s_iterDir, &fno) != FR_OK)
        {
            f_closedir(&s_iterDir);
            s_iterOpen = false;
            return -3;
        }

        if (fno.fname[0] == 0)                  /* album exhausted */
        {
            uint8_t doneIdx = s_matched[s_cursor];

            f_closedir(&s_iterDir);
            s_iterOpen = false;
            s_albumsDone++;
            s_cursor = (uint8_t)((s_cursor + 1) % s_nMatched);

            /* Story-only album (a trip with a story but no photos yet):
             * the story itself is the slide — black photo region + rail. */
            if (s_photosThisAlbum == 0 && story_follow_album(doneIdx) == 0)
            {
                S_DISP_RECT r = { 0, 0, panelW - 1u, panelH - 1u };
                Display_ClearRect(C_BLACK, &r);
                s_shownInCycle++;
                return 0;
            }
            continue;
        }

        if (fno.fattrib & AM_DIR) continue;

        const Album *al = &s_albums[s_matched[s_cursor]];
        char path[300];
        int  rc;

        if (al->name[0])
            snprintf(path, sizeof(path), "%s\\%s\\%s", s_root, al->name, fno.fname);
        else
            snprintf(path, sizeof(path), "%s\\%s", s_root, fno.fname);

        if (name_is_jpg(fno.fname))
            rc = show_jpg(path, panelW, panelH);
        else if (name_is_bmp(fno.fname))
            rc = show_bmp(path, panelW, panelH);
        else if (name_is_png(fno.fname) || name_is_heic(fno.fname))
        {
            printf("[SLIDESHOW] skip %s (PNG/HEIC not decodable on-device; "
                   "convert with scripts/prepare_pictures.py)\n", fno.fname);
            continue;
        }
        else
            continue;   /* not a picture (label.json lands here too) */

        if (rc != 0)
        {
            printf("[SLIDESHOW] skip %s (rc=%d)\n", fno.fname, rc);
            continue;
        }

#if SLIDE_CAPTION
        {
            char caption[96];
            if (al->name[0])
                snprintf(caption, sizeof(caption), "%s/%s", al->name, fno.fname);
            else
                snprintf(caption, sizeof(caption), "%s", fno.fname);
            Display_PutText(caption, (uint32_t)strlen(caption),
                            4, panelH - 20, C_WHITE, C_BLACK, false, 1);
        }
#endif
        /* Photo is up: make the story rail match the album it came from. */
        story_follow_album(s_matched[s_cursor]);

        s_photosThisAlbum++;
        s_shownInCycle++;
        return 0;
    }
}

/*----------------------------------------------------------------------------
 * Main loop (kept as a convenience wrapper over the step API)
 *--------------------------------------------------------------------------*/
int Slideshow_Run(const char *dirPath, uint32_t holdMs)
{
    if (Slideshow_LibScan(dirPath) < 0)
        return -1;

    printf("[SLIDESHOW] %s: %u album(s), %u ms per photo (JPG decoded on-device)\n",
           dirPath, (unsigned)(s_nAlbums - 1), (unsigned)holdMs);

    for (;;)
    {
        int rc = Slideshow_ShowNext();
        if (rc != 0)
            return rc;
        Display_Delay(holdMs);
    }
}
